Revit 2026 API

# ExporterIFCUtilsGetGeometryFromInplaceWall Method

---

Obtains a special snapshot of the geometry of an in-place wall element suitable for export.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static GeometryElement GetGeometryFromInplaceWall(
	FamilyInstance pFamInstWallElem
)
```
```vb
Public Shared Function GetGeometryFromInplaceWall (
	pFamInstWallElem As FamilyInstance
) As GeometryElement
```
```cpp
public:
static GeometryElement^ GetGeometryFromInplaceWall(
	FamilyInstance^ pFamInstWallElem
)
```
```fsharp
static member GetGeometryFromInplaceWall :
        pFamInstWallElem : FamilyInstance -> GeometryElement
```

#### Parameters

pFamInstWallElem FamilyInstance
     The in-place wall instance.

#### Return Value

GeometryElement The in-place wall geometry. Returns  if there is no special geometry for the wall needed for export; the standard geometry of the wall can be used.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace